# brew tap homebrew/bundle
# brew bundle

cask_args appdir: '/Applications'

tap "homebrew/cask"
tap "buo/cask-upgrade"
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap "homebrew/cask-fonts"

# mac app store installation
brew "mas"

# install mac app store apps
mas "Slack for Desktop", id: 803453959
mas "Microsoft Word", id: 462054704      
mas "Microsoft OneNote", id: 784801555   
mas "Microsoft Outlook", id: 985367838   
mas "Microsoft Excel", id: 462058435     
mas "Microsoft PowerPoint", id: 462062816
mas "Enpass - Password Manager", id: 732710998

# cli utilities
brew 'ack'
brew 'bash-completion'
brew 'coreutils'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'gpg'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'nvm'
brew 'tig'
brew 'wget'

# general applications
cask 'visual-studio-code'
cask 'docker'

# fonts
cask 'font-fira-code'